{
  "architectures": ["EncoderDecoderModel"],
  "model_type": "encoder-decoder",
  "encoder": {
    "model_type": "transformer",
    "vocab_size": 30,
    "d_model": 128,
    "max_position_embeddings": 299,
    "num_attention_heads": 8,
    "num_hidden_layers": 6,
    "intermediate_size": 512,
    "hidden_dropout_prob": 0.1,
    "attention_probs_dropout_prob": 0.1
  },
  "decoder": {
    "model_type": "transformer", 
    "vocab_size": 30,
    "d_model": 128,
    "max_position_embeddings": 35,
    "num_attention_heads": 8,
    "num_hidden_layers": 6,
    "intermediate_size": 512,
    "hidden_dropout_prob": 0.1,
    "attention_probs_dropout_prob": 0.1
  },
  "vocab_size": 30,
  "d_model": 128,
  "max_encoder_seq_len": 299,
  "max_decoder_seq_len": 35,
  "input_features": {
    "trajectory_dim": 6,
    "keyboard_dim": 1
  },
  "preprocessing": {
    "normalize_coordinates": true,
    "include_velocities": true,
    "include_accelerations": true
  },
  "inference": {
    "temperature": 1.0,
    "top_k": 10,
    "top_p": 0.9,
    "max_length": 35
  },
  "pad_token_id": 28,
  "bos_token_id": 29,
  "eos_token_id": 26,
  "decoder_start_token_id": 29,
  "max_length": 35,
  "task_specific_params": {
    "swipe_decoding": {
      "early_stopping": true,
      "length_penalty": 1.0,
      "no_repeat_ngram_size": 2
    }
  }
}